tap "abhinav/tap"
tap "hashicorp/tap"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "mongodb/brew"
tap "tetratelabs/getenvoy"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76", link: true
# Google's own build tool
brew "bazel", link: false
# User-friendly launcher for Bazel
brew "bazelisk"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU compiler collection
brew "gcc"
# High performance message passing library
brew "open-mpi"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Library for parsing ini files
brew "iniparser"
# Cross-platform library for audio I/O
brew "portaudio"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Console Matrix
brew "cmatrix"
# Top-like interface for container metrics
brew "ctop"
# Debugger for the Go programming language
brew "delve"
# Cloud-native high-performance edge/middle/service proxy
brew "envoy"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Git extension for versioning large files
brew "git-lfs"
# Cross-platform application and UI framework
brew "qt"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Like cURL, but for gRPC
brew "grpcurl"
# Improved top (interactive process viewer)
brew "htop"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Extendable open source continuous integration server
brew "jenkins-lts"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Portable Foreign Function Interface library
brew "libffi"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Library for complex text layout
brew "libraqm"
# Next-gen compiler infrastructure
brew "llvm"
# Computer algebra system
brew "maxima"
# Platform built on V8 to build network applications
brew "node"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# Open source relational database management system
brew "mysql-client@5.7"
# MySQL database connector for C++ applications
brew "mysql-connector-c++"
# Open source relational database management system
brew "mysql@5.7"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@20"
# Discrete-event network simulator
brew "ns-3"
# Manage multiple Node.js versions
brew "nvm"
# Open source computer vision library
brew "opencv"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Object-relational database system
brew "postgresql@15", restart_service: :changed
# Protoc plugin that generates code for gRPC-Web clients
brew "protoc-gen-grpc-web"
# Python version management
brew "pyenv"
# Migrate pip packages from one Python version to another
brew "pyenv-pip-migrate"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Python interface to Tcl/Tk
brew "python-tk@3.9"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Command-line tool to customize Spotify client
brew "spicetify-cli", link: false
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Cross platform GUI for Maxima
brew "wxmaxima"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Free and open-source web browser
cask "chromium"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Development environment
cask "hashicorp-vagrant"
# Self-contained Python driver for communicating with MySQL servers
cask "mysql-connector-python"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Command-line shell and scripting language
cask "powershell"
# Format code in Xcode with clang-format
cask "xcodeclangformat"
vscode "aaronthomas.vscode-snazzy-operator"
vscode "adpyke.codesnap"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "divyanshuagrawal.competitive-programming-helper"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "golang.go"
vscode "maxfieldwalker.vscode-color-theme-spirited-away"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "orsenkucher.vscode-graphql"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "streetsidesoftware.code-spell-checker"
vscode "twxs.cmake"
vscode "xabikos.reactsnippets"
vscode "yzhang.markdown-all-in-one"
